Repository: skroggel/t3-cat-search
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# indexHook.contendIndexed
source: The following content was indexed (record: %s):
de: Der folgende Inhalt wurde indexiert (Datensatz: %s):

# extConf.fulltextIndexTable
source: Basis-Table for fulltext indexing
de: Basis-Tabelle für Volltext-Indexierung

# extConf.fulltextIndexFields
source: Fields for fulltext indexing. Use dot-notation to refer tu subtables (and subtables of the subtables). The title- and teaser-field are searched separately.
de: Felder für Volltext-Indexierung. Punkt-Notation verwenden, um auf Untertabellen (und Untertabellen der Untertabellen) zu verweisen. Die Felder title und teaser werden separat durchsucht.

# extConf.showIndexResult
source: Show result of indexing in backend
de: Zeige Indexierungsergebnis im Backend an

# extConf.pageTitleFields
source: Comma-separated list of fields for generating the page title. First field with data is used.
de: Kommaseparierte Liste von Feldern für die Generierung des Seitentitels. Erstes Feld mit Daten wird verwendet.

# extConf.pageTitleSeparator
source: Separator for page title. If set, the page title is composed of all defined fields.
de: Trennzeichen für Seitentitel. Wenn gesetzt, wird der Seitentitel aus allen definierten Feldern zusammengesetzt.

# extConf.contentElementsAllowedCTypes
source: Allowed cTypes for linked content elements.: fieldValue,fieldLabel;anotherFieldValue,anotherFieldLabel
de: Erlaubte cTypes für verknüpfte Content-Elemente.: fieldValue,fieldLabel;anotherFieldValue,anotherFieldLabel

# extConf.contentElementsDefaultCType
source: Standard cType for linked content elements.
de: Standard-cType fpr verknüpfte Content-Elemente.

# extConf.primaryFilterType1
source: The filter-type-uid to use for primary filter 1.
de: Die Filter-Typ-Uid für den Primär-Filter 1.

# extConf.primaryFilterType2
source: The filter-type-uid to use for primary filter 2.
de: Die Filter-Typ-Uid für den Primär-Filter 2.

# extConf.primaryFilterType3
source: The filter-type-uid to use for primary filter 3.
de: Die Filter-Typ-Uid für den Primär-Filter 3.

# extConf.primaryFilterType4
source: The filter-type-uid to use for primary filter 4.
de: Die Filter-Typ-Uid für den Primär-Filter 4.

# extConf.primaryFilterType5
source: The filter-type-uid to use for primary filter 5.
de: Die Filter-Typ-Uid für den Primär-Filter 5.

# contentElementWizward.header
source: Category Search
de: Kategorien-Suche

# flexform.tab.common
source: Common
de: Allgemein

# flexform.tab.preset
source: Preset
de: Voreinstellungen

# flexform.tab.filters
source: Shown filters for search
de: Angezeigte Filter für Suche

# flexform.tab.view
source: View
de: Ansicht

# flexform.settings.recordType
source: Record Type
de: Datensatzart

# flexform.settings.recordType.0
source: All
de: Alle

# flexform.settings.recordType.1
source: Only Documents
de: Nur Dokumente

# flexform.settings.recordType.2
source: Only Products
de: Nur Produkte

# flexform.settings.recordType.3
source: Only Accessory
de: Nur Zubehör

# flexform.settings.item
source: Item (if not given via link-parameters)
de: Item (wenn nicht über Link-Parameter übergeben)

# flexform.settings.filterExclude
source: Filter (exclude)
de: Filter (ausschließen)

# flexform.settings.filterType1
source: Filter Type 1
de: Filter Typ 1

# flexform.settings.filterType1AllowMultiple
source: Allow multiple select for filter 1
de: Mehrfachauswahl für Filter 1 erlauben

# flexform.settings.filterType2
source: Filter Type 2
de: Filter Typ 2

# flexform.settings.filterType2AllowMultiple
source: Allow multiple select for filter 2
de: Mehrfachauswahl für Filter 2 erlauben

# flexform.settings.filterType3
source: Filter Type 3
de: Filter Typ 3

# flexform.settings.filterType3AllowMultiple
source: Allow multiple select for filter 3
de: Mehrfachauswahl für Filter 3 erlauben

# flexform.settings.filterType4
source: Filter Type 4
de: Filter Typ 4

# flexform.settings.filterType4AllowMultiple
source: Allow multiple select for filter 4
de: Mehrfachauswahl für Filter 4 erlauben

# flexform.settings.filterType5
source: Filter Type 5
de: Filter Typ 5

# flexform.settings.filterType5AllowMultiple
source: Allow multiple select for filter 5
de: Mehrfachauswahl für Filter 5 erlauben

# flexform.settings.searchPid
source: Page with Search
de: Seite mit Suche

# flexform.settings.detailPid
source: Page with Detail-View
de: Seite mit Detailansicht

# flexform.settings.detail2Pid
source: Page with Detail-View (2)
de: Seite mit Detailansicht (2)

# flexform.settings.layout
source: Layout
de: Darstellung

# flexform.settings.layout.default
source: Default
de: Standard

# flexform.settings.layout.big
source: Big
de: Groß

# flexform.settings.maxResults
source: Maximum number of results
de: Maximale Anzahl an Ergebnissen

# flexform.settings.maxResultsPerPage
source: Maximum number of results per Page
de: Maximale Anzahl an Ergebnissen je Seite

# flexform.settings.maxPages
source: Maximum number of pages shown
de: Maximale Anzahl an Seiten

# flexform.settings.hidePagination
source: Hide pagination
de: Pagination ausblenden

# flexform.settings.showFilterByTextQuery
source: Show Freetext-Search
de: Zeige Freitext-Suche

# flexform.settings.showFilterByYear
source: Show Year-Filter
de: Zeige Jahres-Filter

# flexform.settings.showFilterByRelatedProduct
source: Show Related Product-Filter
de: Zeige Verwandtes-Produkt-Filter

# flexform.settings.showTags
source: Show Tags
de: Zeige Tags

# plugin.tx_catsearch_search.title
source: CatSearch: Search
de: CatSearch: Suche

# plugin.tx_catsearch_searchrelated.title
source: CatSearch: Search – Related Elements
de: CatSearch: Suche – Verwandte Elemente

# plugin.tx_catsearch_teaserfiltered.title
source: CatSearch: Filterable Teaser
de: CatSearch: Filterbarer Teaser

# plugin.tx_catsearch_detail.title
source: CatSearch: Detail-View
de: CatSearch: Detailansicht

# plugin.tx_catsearch_detail2.title
source: CatSearch: Detail-View (2)
de: CatSearch: Detailansicht (2)
